// Channel conversion table
// For BS/CS setting, refer to
// http://www5e.biglobe.ne.jp/~kazu_f/digital-sat/index.html
//

typedef struct _Channel_conv_table {
    char *channel;
    int sid;		// Service ID
    int tsid;		// TS ID
    int freq;		// frequency no.
} Channel_conv_table;

Channel_conv_table channel_table[] = {
    {"BS01_0", 151, 16400, 101},  /* 151ch：BS朝日 */
    {"BS01_1", 161, 16401, 101},  /* 161ch：BS-TBS */
    {"BS03_0", 191, 16432, 103},  /* 191ch：WOWOWプライム */
    {"BS03_1", 171, 16433, 103},  /* 171ch：BSジャパン */
    {"BS05_0", 192, 17488, 105},  /* 192ch：WOWOWライブ */
    {"BS05_1", 193, 17489, 105},  /* 193ch：WOWOWシネマ */
    {"BS07_0", 201, 17520, 107},  /* 201ch：スターチャンネル2 */
    {"BS07_0", 202, 17520, 107},  /* 202ch：スターチャンネル3 */
    {"BS07_1", 236, 18033, 107},  /* 236ch：BSアニマックス */
    {"BS07_2", 256, 18034, 107},  /* 256ch：ディズニー・チャンネル */
    {"BS09_0", 211, 16528, 109},  /* 211ch：BS11 */
    {"BS09_1", 200, 16529, 109},  /* 200ch：スターチャンネル1 */
    {"BS09_2", 222, 16530, 109},  /* 222ch：TwellV */
    {"BS11_0", 238, 18096, 111},  /* 238ch：FOXスポーツ＆エンターテイメント */
    {"BS11_1", 241, 18097, 111},  /* 241ch：BSスカパー！ */
    {"BS11_2", 231, 18098, 111},  /* 231ch：放送大学BS1 */
    {"BS11_2", 232, 18098, 111},  /* 232ch：放送大学BS2 */
    {"BS11_2", 233, 18098, 111},  /* 233ch：放送大学BS3 */
    {"BS13_0", 141, 16592, 113},  /* 141ch：BS日テレ */
    {"BS13_1", 181, 16593, 113},  /* 181ch：BSフジ */
    {"BS15_0", 101, 16625, 115},  /* 101ch：NHK BS1 */
    {"BS15_1", 103, 16626, 115},  /* 103ch：NHK BSプレミアム */
    {"BS19_0", 234, 18224, 119},  /* 234ch：グリーンチャンネル */
    {"BS19_1", 242, 18225, 119},  /* 242ch：J SPORTS 1 */
    {"BS19_2", 243, 18226, 119},  /* 243ch：J SPORTS 2 */
    {"BS21_0", 252, 18256, 121},  /* 252ch：イマジカBS・映画 */
    {"BS21_1", 244, 18257, 121},  /* 244ch：J SPORTS 3 */
    {"BS21_2", 245, 18258, 121},  /* 245ch：J SPORTS 4 */
    {"BS23_0", 251, 18288, 123},  /* 251ch：BS釣りビジョン */
    {"BS23_1", 255, 18289, 123},  /* 255ch：BS日本映画専門チャンネル */
    {"BS23_2", 258, 18290, 123},  /* 258ch：Dlife */

    {"CS2",    296, 24608, 202},  /* 296ch：TBSチャンネル1 */
    {"CS2",    298, 24608, 202},  /* 298ch：テレ朝チャンネル1 */
    {"CS2",    299, 24608, 202},  /* 299ch：テレ朝チャンネル2 */
    {"CS4",    100, 28736, 204},  /* 100ch：スカパー！プロモ100 */
    {"CS4",    227, 28736, 204},  /* 227ch：ザ・シネマ */
    {"CS4",    223, 28736, 204},  /* 223ch：映画・チャンネルNECO */
    {"CS4",    250, 28736, 204},  /* 250ch：スカイA */
    {"CS4",    342, 28736, 204},  /* 342ch：ヒストリーチャンネル */
    {"CS4",    363, 28736, 204},  /* 363ch：囲碁・将棋チャンネル */
    {"CS6",    294, 28768, 206},  /* 294ch：ホームドラマチャンネル */
    {"CS6",    329, 28768, 206},  /* 329ch：歌謡ポップスチャンネル */
    {"CS6",    323, 28768, 206},  /* 323ch：MTV HD */
    {"CS6",    354, 28768, 206},  /* 354ch：CNNj */
    {"CS6",    340, 28768, 206},  /* 340ch：ディスカバリーチャンネル */
    {"CS6",    341, 28768, 206},  /* 341ch：アニマルプラネット */
    {"CS8",    055, 28768, 208},  /* 055ch：ショップチャンネル */
    {"CS8",    349, 24704, 208},  /* 349ch：日テレNEWS24 */
    {"CS8",    218, 24704, 208},  /* 218ch：東映チャンネル */
    {"CS8",    219, 24704, 208},  /* 219ch：衛星劇場 */
    {"CS8",    326, 24704, 208},  /* 326ch：ミュージック・エア */
    {"CS8",    339, 24704, 208},  /* 339ch：ディズニージュニア */
    {"CS10",   800, 24736, 210},  /* 800ch：スカサカ！ */
    {"CS10",   801, 24736, 210},  /* 801ch：スカチャン1 */
    {"CS10",   802, 24736, 210},  /* 802ch：スカチャン2 */
    {"CS10",   805, 24736, 210},  /* 805ch：スカチャン3 */
    {"CS12",   254, 28864, 212},  /* 254ch：GAORA */
    {"CS12",   325, 28864, 212},  /* 325ch：MUSIC ON! TV（エムオン！）HD */
    {"CS12",   330, 28864, 212},  /* 330ch：キッズステーション */
    {"CS14",   292, 28896, 214},  /* 292ch：時代劇専門チャンネルHD */
    {"CS14",   293, 28896, 214},  /* 293ch：ファミリー劇場HD */
    {"CS14",   310, 28896, 214},  /* 310ch：スーパー！ドラマTV HD */
    {"CS16",   290, 28928, 216},  /* 290ch：TAKARAZUKA SKY STAGE */
    {"CS16",   305, 28928, 216},  /* 305ch：チャンネル銀河 */
    {"CS16",   333, 28928, 216},  /* 333ch：アニメシアターX (AT-X) */
    {"CS16",   311, 28928, 216},  /* 311ch：AXN */
    {"CS16",   343, 28928, 216},  /* 343ch：ナショナル ジオグラフィック */
    {"CS16",   353, 28928, 216},  /* 353ch：BBCワールドニュース */
    {"CS18",   240, 28960, 218},  /* 240ch：ムービープラスHD */
    {"CS18",   262, 28960, 218},  /* 262ch：ゴルフネットワークHD */
    {"CS18",   314, 28960, 218},  /* 314ch：女性チャンネル♪LaLa TV */
    {"CS20",   307, 28992, 220},  /* 307ch：フジテレビONE */
    {"CS20",   308, 28992, 220},  /* 308ch：フジテレビTWO */
    {"CS20",   309, 28992, 220},  /* 309ch：フジテレビNEXT */
    {"CS22",   161, 29024, 222},  /* 161ch：QVC */
    {"CS22",   297, 29024, 222},  /* 297ch：TBSチャンネル2 */
    {"CS22",   351, 29024, 222},  /* 351ch：TBSニュースバード */
    {"CS22",   312, 29024, 222},  /* 312ch：FOX */
    {"CS22",   322, 29024, 222},  /* 322ch：スペースシャワーTV */
    {"CS22",   331, 29024, 222},  /* 331ch：カートゥーン ネットワーク */
    {"CS24",   257, 29056, 224},  /* 257ch：日テレジータス */
    {"CS24",   295, 29056, 224},  /* 295ch：MONDO TV */
    {"CS24",   300, 29056, 224},  /* 300ch：日テレプラス */
    {"CS24",   316, 29056, 224},  /* 316ch：AXNミステリー */
    {"CS24",   321, 29056, 224},  /* 321ch：スペースシャワーTVプラス */

    {"" , 0, 0, 0}  /* terminate */
};

int channel_conv(char* channel);
