// Channel conversion table
// For BS/CS setting, refer to
// http://www5e.biglobe.ne.jp/~kazu_f/digital-sat/index.html
//

typedef struct _Channel_conv_table {
    char *channel;
    int freq;		// frequency no.
    int tsid;		// TS ID
    int sid;		// service ID
} Channel_conv_table;

Channel_conv_table channel_table[] = {
    {"BS01_0", 101, 16400, 151},  /* BS朝日 */
    {"BS01_1", 101, 16401, 161},  /* BS-TBS */
    {"BS03_0", 103, 16432, 191},  /* WOWOWプライム */
    {"BS03_1", 103, 16433, 171},  /* BSジャパン */
    {"BS05_0", 105, 17488, 192},  /* WOWOWライブ */
    {"BS05_1", 105, 17489, 193},  /* WOWOWシネマ */
    {"BS07_0", 107, 17520, 201},  /* スター・チャンネル2 */
    {"BS07_1", 107, 18033, 236},  /* BSアニマックス */
    {"BS07_2", 107, 18034, 256},  /* ディズニー・チャンネル */
    {"BS07_3", 107, 17520, 202},  /* スター・チャンネル3 */
    {"BS09_0", 109, 16528, 211},  /* BS11 */
    {"BS09_1", 109, 16529, 200},  /* スター・チャンネル1 */
    {"BS09_2", 109, 16530, 222},  /* TwellV */
    {"BS11_0", 111, 18096, 238},  /* FOX bs238 */
    {"BS11_1", 111, 18097, 241},  /* BSスカパー！ */
    {"BS11_2", 111, 18098, 231},  /* 放送大学BS1 */
    {"BS11_3", 111, 18098, 232},  /* 放送大学BS2 */
    {"BS11_4", 111, 18098, 233},  /* 放送大学BS3 */
    {"BS13_0", 113, 16592, 141},  /* BS日テレ */
    {"BS13_1", 113, 16593, 181},  /* BSフジ */
    {"BS15_0", 115, 16625, 101},  /* NHK BS1 */
    {"BS15_1", 115, 16626, 103},  /* NHK BSプレミアム */
    {"BS19_0", 119, 18224, 234},  /* グリーンチャンネル */
    {"BS19_1", 119, 18225, 242},  /* J SPORTS 1 */
    {"BS19_2", 119, 18226, 243},  /* J SPORTS 2 */
    {"BS21_0", 121, 18256, 252},  /* IMAGICA BS */
    {"BS21_1", 121, 18257, 244},  /* J SPORTS 3 */
    {"BS21_2", 121, 18258, 245},  /* J SPORTS 4 */
    {"BS23_0", 123, 18288, 251},  /* BS釣りビジョン */
    {"BS23_1", 123, 18259, 255},  /* 日本映画専門チャンネル */
    {"BS23_2", 123, 18290, 258},  /* D-Life */

    {"CS02_0", 202, 24608, 296},  /* TBSチャンネル1 */
    {"CS02_1", 202, 24608, 298},  /* テレ朝チャンネル1 */
    {"CS02_2", 202, 24608, 299},  /* テレ朝チャンネル2 */
    {"CS04_0", 204, 28736, 100},  /* スカパー！プロモ */
    {"CS04_1", 204, 28736, 223},  /* 映画・チャンネルNECO */
    {"CS04_2", 204, 28736, 227},  /* ザ・シネマ */
    {"CS04_3", 204, 28736, 250},  /* スカイA */
    {"CS04_4", 204, 28736, 342},  /* ヒストリーチャンネル */
    {"CS04_5", 204, 28736, 363},  /* 囲碁・将棋チャンネル */
    {"CS06_0", 206, 28768, 294},  /* ホームドラマチャンネル */
    {"CS06_1", 206, 28768, 323},  /* MTV HD */
    {"CS06_2", 206, 28768, 329},  /* 歌謡ポップスチャンネル */
    {"CS06_3", 206, 28768, 340},  /* ディスカバリーチャンネル */
    {"CS06_4", 206, 28768, 341},  /* アニマルプラネット */
    {"CS06_5", 206, 28768, 354},  /* CNNj */
    {"CS08_0", 208, 24704, 055},  /* ショップ チャンネル */
    {"CS08_1", 208, 24704, 218},  /* 東映チャンネル */
    {"CS08_2", 208, 24704, 219},  /* 衛星劇場 */
    {"CS08_3", 208, 24704, 326},  /* ミュージック・エア */
    {"CS08_4", 208, 24704, 339},  /* ディズニージュニア */
    {"CS08_5", 208, 24704, 349},  /* 日テレNEWS24 */
    {"CS10_0", 210, 24736, 800},  /* スカチャン0 */
    {"CS10_1", 210, 24736, 801},  /* スカチャン1 */
    {"CS10_2", 210, 24736, 802},  /* スカチャン2 */
    {"CS10_3", 210, 24736, 805},  /* スカチャン3 */
    {"CS12_0", 212, 28864, 254},  /* GAORA */
    {"CS12_1", 212, 28864, 325},  /* MUSIC ON! TV（エムオン！）HD */
    {"CS12_2", 212, 28864, 330},  /* キッズステーション */
    {"CS14_0", 214, 28896, 292},  /* 時代劇専門チャンネルHD H */
    {"CS14_1", 214, 28896, 293},  /* ファミリー劇場HD */
    {"CS14_2", 214, 28896, 310},  /* スーパー！ドラマTV HD */
    {"CS16_0", 216, 28928, 290},  /* TAKARAZUKA SKY STAGE */
    {"CS16_1", 216, 28928, 305},  /* チャンネル銀河 */
    {"CS16_2", 216, 28928, 311},  /* AXN */
    {"CS16_3", 216, 28928, 333},  /* アニメシアターX (AT-X) */
    {"CS16_4", 216, 28928, 343},  /* ナショナル ジオグラフィック */
    {"CS16_5", 216, 28928, 353},  /* BBCワールドニュース */
    {"CS18_0", 218, 28960, 240},  /* ムービープラスHD  */
    {"CS18_1", 218, 28960, 262},  /* ゴルフネットワークHD  */
    {"CS18_2", 218, 28960, 314},  /* 女性チャンネル♪LaLa TV */
    {"CS20_0", 220, 28992, 307},  /* フジテレビONE */
    {"CS20_1", 220, 28992, 308},  /* フジテレビTWO */
    {"CS20_2", 220, 28992, 309},  /* フジテレビNEXT */
    {"CS22_0", 222, 29024, 161},  /* QVC */
    {"CS22_1", 222, 29024, 297},  /* TBSチャンネル2 */
    {"CS22_2", 222, 29024, 312},  /* TBSニュースバード */
    {"CS22_3", 222, 29024, 322},  /* FOX */
    {"CS22_4", 222, 29024, 331},  /* スペースシャワーTV */
    {"CS22_5", 222, 29024, 351},  /* カートゥーン ネットワーク */
    {"CS24_0", 224, 29056, 257},  /* 日テレジータス */
    {"CS24_1", 224, 29056, 300},  /* 日テレプラス */
    {"CS24_2", 224, 29056, 316},  /* AXNミステリー */
    {"CS24_3", 224, 29056, 321},  /* スペースシャワーTVプラス */
    {"CS24_4", 224, 29056, 362},  /* 旅チャンネル */

    {"" , 0, 0, 0} /* terminate */
};

int channel_conv(char* channel);
